cask_args appdir: '/Applications'

tap "homebrew/services"
tap 'mongodb/brew'
tap 'puma/puma'

# gnu stuff
brew 'coreutils'
brew 'findutils'

brew 'ack' # a grep-like source code search tool
brew 'gcc' # the GNU Compiler
brew 'git-delta' # syntax-highlighting pager for git and diff output
brew 'git' # distributed revision control system
brew 'go' # go programming language
brew 'grc' # colorize logfiles and command output
brew 'fnm' # Node.js version manager and corepack installer
brew 'hub' # adds GitHub support to git on the command-line
brew 'imagemagick' # Image manipulation library
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'libgit2' # C library of Git core methods that is re-entrant and linkable
brew 'mas' # CLI for installing app from Mac App Store
brew 'mongodb-community'
brew 'openssl' # Cryptography and SSL/TLS Toolkit
brew 'postgresql' # Object-relational database system
brew 'qmk/qmk/qmk' # there's a keeb nerd over here
brew 'readline' # Library for command-line editing
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'starship' # Cross-shell prompt for astronauts
brew 'wget' # Internet file retriever
brew 'zsh-autocomplete' # Zsh plugin that adds tab completion for common commands
brew 'zsh-autosuggestions' # FISH-like autosuggestions for ZSH
brew 'zsh-completions' # Additional completion definitions for Zsh
brew 'zsh-history-substring-search' # Zsh port of Fish history search
brew 'zsh-you-should-use' # Zsh plugin that reminds you to use existing aliases
brew 'zsh-syntax-highlighting' # Terminal bliss
brew 'zsh' # UNIX shell (command interpreter)

cask '1password' # Password manager
cask 'charles' # HTTP proxy / monitor
cask 'discord' # VoIP and chat app
cask 'dropbox' # File hosting service
cask 'firefox' # Web browser
cask 'font-fira-code-nerd-font' # Monospace font with programming ligatures
cask 'google-chrome' # Web browser
cask 'hyper' # Terminal emulator built on web technologies
cask 'insomnia' # REST client
cask 'keybase' # Encrypted messaging and file sharing
cask 'muzzle' # Mute notifications when screen sharing
cask 'nordvpn' # VPN service
cask 'qmk-toolbox' # QMK firmware flashing tool
cask 'spotify' # Music streaming service
cask 'tableplus' # GUI for databases
cask 'todoist' # Task manager
cask 'visual-studio-code' # Code editor
cask 'vivaldi' # Web browser
cask 'warp' # Terminal built for speed and safety
cask 'xquartz' # X11 server for macOS
cask 'zoom' # Video conferencing software

# Install mas apps
mas 'Be Focused',  id: 973134470 # Pomodoro Focus Timer
mas 'CopyClip',    id: 595191960 # Clipboard manager
mas 'Dato',        id: 1470584107 # Calendar and time zone menu bar app
mas 'Hand Mirror', id: 1502839586 # Screen mirroring app
mas 'Keycastr',    id: 1058125028 # Keystroke visualizer
mas 'Lungo',       id: 1263070803 # Prevents your Mac from going to sleep
mas 'Magnet',      id: 441258766 # Window manager