cask_args appdir: '/Applications'

tap "homebrew/services"
tap 'mongodb/brew'
tap 'puma/puma'

# gnu stuff
brew 'coreutils'
brew 'findutils'

brew 'ack' # a grep-like source code search tool
brew 'gcc' # the GNU Compiler
brew 'git-delta' # syntax-highlighting pager for git and diff output
brew 'git' # distributed revision control system
brew 'go' # go programming language
brew 'grc' # colorize logfiles and command output
brew 'fnm' # Node.js version manager and corepack installer
brew 'hub' # adds GitHub support to git on the command-line
brew 'imagemagick' # Image manipulation library
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'libgit2' # C library of Git core methods that is re-entrant and linkable
brew 'mas' # CLI for installing app from Mac App Store
brew 'mongodb-community'
brew 'openssl' # Cryptography and SSL/TLS Toolkit
brew 'postgresql' # Object-relational database system
brew 'qmk/qmk/qmk' # there's a keeb nerd over here
brew 'readline' # Library for command-line editing
brew 'redis' # Persistent key-value database, with built-in net interface
brew 'starship' # Cross-shell prompt for astronauts
brew 'wget' # Internet file retriever
brew 'zsh-autocomplete' # Zsh plugin that adds tab completion for common commands
brew 'zsh-autosuggestions' # FISH-like autosuggestions for ZSH
brew 'zsh-completions' # Additional completion definitions for Zsh
brew 'zsh-history-substring-search' # Zsh port of Fish history search
brew 'zsh-you-should-use' # Zsh plugin that reminds you to use existing aliases
brew 'zsh-syntax-highlighting' # Terminal bliss
brew 'zsh' # UNIX shell (command interpreter)

cask '1password'
cask 'charles'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'font-fira-code-nerd-font'
cask 'google-chrome'
cask 'hyper'
cask 'insomnia'
cask 'keybase'
cask 'muzzle'
cask 'nordvpn'
cask 'qmk-toolbox'
cask 'spotify'
cask 'tableplus'
cask 'todoist'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'warp'
cask 'xquartz'
cask 'zoom'
